In [2]:
# C

In [3]:
emp_id = c(1:5)

In [5]:
emp_name = c("aniket", "mahak", "seema", "prince", "mukul")

In [6]:
emp_name

[1] "aniket" "mahak"  "seema"  "prince" "mukul"

In [8]:
salary = c (100, 30.2, 200, 785, 455)

In [23]:
start_date = as.Date(c("2012-01-01","2013-09-20","2011-05-02","2015-12-20","2015-12-2000"))

In [24]:
emp.data <- data.frame(
    emp_id, 
    emp_name,
    salary,
    start_date,
    stringsAsFactors = FALSE  
)

In [25]:
emp.data

  emp_id emp_name salary start_date
1 1      aniket   100.0  2012-01-01
2 2      mahak     30.2  2013-09-20
3 3      seema    200.0  2011-05-02
4 4      prince   785.0  2015-12-20
5 5      mukul    455.0  2015-12-20

In [27]:
emp1.data <- data.frame(
    emp_id, 
    start_date,
    emp_name,
    salary,
    stringsAsFactors = FALSE  
)

In [28]:
emp1.data

  emp_id start_date emp_name salary
1 1      2012-01-01 aniket   100.0
2 2      2013-09-20 mahak     30.2
3 3      2011-05-02 seema    200.0
4 4      2015-12-20 prince   785.0
5 5      2015-12-20 mukul    455.0

In [29]:
# Structure of data
str(emp1.data)

'data.frame':	5 obs. of  4 variables:
 $ emp_id    : int  1 2 3 4 5
 $ start_date: Date, format: "2012-01-01" "2013-09-20" ...
 $ emp_name  : chr  "aniket" "mahak" "seema" "prince" ...
 $ salary    : num  100 30.2 200 785 455

In [30]:
#Summary of data:  Statistical summary of data
summary(emp1.data)

     emp_id    start_date           emp_name             salary
 Min.   :1   Min.   :2011-05-02   Length:5           Min.   : 30.2
 1st Qu.:2   1st Qu.:2012-01-01   Class :character   1st Qu.:100.0
 Median :3   Median :2013-09-20   Mode  :character   Median :200.0
 Mean   :3   Mean   :2013-10-18                      Mean   :314.0
 3rd Qu.:4   3rd Qu.:2015-12-20                      3rd Qu.:455.0
 Max.   :5   Max.   :2015-12-20                      Max.   :785.0